app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
    # Completed... if the form is there, it will come back as ""... if it's not, probably will come back as nil. Pick one! (Or both and code for both)
    @incomplete_tasks = Task.where(completed: nil)
---
SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."completed" IS NULL LIMIT $1  [["LIMIT", 1]]

  def show
    task_id = params[:id].to_i

    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Chores"], ["description", "Mopping & Sweeping"], ["created_at", "2019-10-04 17:22:02.237659"], ["updated_at", "2019-10-04 17:22:02.237659"]]

  def edit
    @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    @task = Task.find_by(id: params[:id])

    if @task.nil?
      head :internal_server_error
      return
    end

    @task.name = params[:task][:name]
    @task.description = params[:task][:description]
    @task.completed = params[:task][:completed]

    if @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "testing"], ["updated_at", "2019-10-04 23:12:33.586274"], ["id", 2]]

  def destroy
    task_to_delete_id = params[:id].to_i

    if task_to_delete_id.nil?
      redirect_to tasks_path
    else
      Task.destroy(task_to_delete_id)
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 13]]

  def completed
    #HERE IS WHERE UPDATE TIME

    Task.where(id: params[:task_id]).update_all(completed: DateTime.now)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = '2019-10-04 23:17:52.352642' WHERE "tasks"."id" = $1  [["id", 1]]