app/models/task.rb

  def self.incomplete
    return Task.where(completed: nil)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."completed" = $1 LIMIT $2  [["completed", "f"], ["LIMIT", 1]]